Revit 2016 API
FabricationPart.IsDimensionCalculated Method
 Checks if the fabricataion dimension is calculated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public bool IsDimensionCalculated(
	FabricationDimensionDefinition dim
)
Visual Basic
Public Function IsDimensionCalculated ( _
	dim As FabricationDimensionDefinition _
) As Boolean
Visual C++
public:
bool IsDimensionCalculated(
	FabricationDimensionDefinition^ dim
)
Parameters
dim
Type: Autodesk.Revit.DB.FabricationDimensionDefinition
 The fabrication dimension.
Return Value
 True if the fabricataion dimension is calculated.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace